http/results/retro2-classic-libev-R20000-r3.txt
Running 20s test @ http://127.0.0.1:19301/
  4 threads and 100 connections
  Thread calibration: mean lat.: 4.338ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 4.736ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 4.779ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 4.801ms, rate sampling interval: 20ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.85ms    4.10ms  25.42ms   84.23%
    Req/Sec     5.13k     1.16k    9.21k    72.64%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.04ms
 75.000%    5.11ms
 90.000%    9.88ms
 99.000%   19.81ms
 99.900%   22.86ms
 99.990%   24.62ms
 99.999%   25.42ms
100.000%   25.44ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.075     0.000000            1         1.00
       0.866     0.100000        19740         1.11
       1.210     0.200000        39496         1.25
       1.501     0.300000        59220         1.43
       1.760     0.400000        78994         1.67
       2.041     0.500000        98717         2.00
       2.207     0.550000       108554         2.22
       2.409     0.600000       118449         2.50
       2.697     0.650000       128301         2.86
       3.267     0.700000       138120         3.33
       5.111     0.750000       147985         4.00
       6.011     0.775000       152934         4.44
       6.799     0.800000       157884         5.00
       7.479     0.825000       162784         5.71
       8.167     0.850000       167730         6.67
       8.959     0.875000       172653         8.00
       9.415     0.887500       175144         8.89
       9.879     0.900000       177617        10.00
      10.399     0.912500       180075        11.43
      10.999     0.925000       182513        13.33
      11.663     0.937500       185003        16.00
      12.039     0.943750       186238        17.78
      12.439     0.950000       187472        20.00
      12.887     0.956250       188682        22.86
      13.415     0.962500       189912        26.67
      14.135     0.968750       191151        32.00
      14.567     0.971875       191767        35.56
      15.167     0.975000       192385        40.00
      15.927     0.978125       192996        45.71
      17.023     0.981250       193622        53.33
      18.015     0.984375       194230        64.00
      18.527     0.985938       194542        71.11
      18.991     0.987500       194849        80.00
      19.471     0.989062       195156        91.43
      20.079     0.990625       195468       106.67
      20.591     0.992188       195774       128.00
      20.767     0.992969       195925       142.22
      20.959     0.993750       196085       160.00
      21.215     0.994531       196235       182.86
      21.439     0.995313       196388       213.33
      21.695     0.996094       196541       256.00
      21.823     0.996484       196622       284.44
      21.983     0.996875       196698       320.00
      22.111     0.997266       196773       365.71
      22.255     0.997656       196849       426.67
      22.383     0.998047       196931       512.00
      22.463     0.998242       196978       568.89
      22.527     0.998437       197003       640.00
      22.623     0.998633       197046       731.43
      22.751     0.998828       197080       853.33
      22.895     0.999023       197124      1024.00
      22.927     0.999121       197138      1137.78
      23.071     0.999219       197162      1280.00
      23.167     0.999316       197178      1462.86
      23.295     0.999414       197197      1706.67
      23.455     0.999512       197215      2048.00
      23.535     0.999561       197227      2275.56
      23.599     0.999609       197237      2560.00
      23.711     0.999658       197244      2925.71
      23.871     0.999707       197254      3413.33
      24.111     0.999756       197263      4096.00
      24.159     0.999780       197270      4551.11
      24.207     0.999805       197273      5120.00
      24.415     0.999829       197278      5851.43
      24.495     0.999854       197285      6826.67
      24.527     0.999878       197287      8192.00
      24.575     0.999890       197290      9102.22
      24.655     0.999902       197293     10240.00
      24.767     0.999915       197296     11702.86
      24.799     0.999927       197297     13653.33
      24.847     0.999939       197299     16384.00
      24.975     0.999945       197301     18204.44
      25.023     0.999951       197303     20480.00
      25.023     0.999957       197303     23405.71
      25.039     0.999963       197304     27306.67
      25.087     0.999969       197305     32768.00
      25.119     0.999973       197306     36408.89
      25.151     0.999976       197307     40960.00
      25.151     0.999979       197307     46811.43
      25.167     0.999982       197308     54613.33
      25.167     0.999985       197308     65536.00
      25.423     0.999986       197309     72817.78
      25.423     0.999988       197309     81920.00
      25.423     0.999989       197309     93622.86
      25.439     0.999991       197311    109226.67
      25.439     1.000000       197311          inf
#[Mean    =        3.845, StdDeviation   =        4.103]
#[Max     =       25.424, Total count    =       197311]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  398612 requests in 20.00s, 805.15MB read
Requests/sec:  19929.80
Transfer/sec:     40.26MB

JSON Output:
{
	"requests": 398612,
	"duration_in_microseconds": 20000798.00,
	"bytes": 844260216,
	"requests_per_sec": 19929.80,
	"bytes_transfer_per_sec": 42211326.57,
	"latency_distribution": [
		{
			"percentile": 50,
			"latency_in_microseconds": 2041
		},
		{
			"percentile": 75,
			"latency_in_microseconds": 5111
		},
		{
			"percentile": 90,
			"latency_in_microseconds": 9879
		},
		{
			"percentile": 99,
			"latency_in_microseconds": 19807
		},
		{
			"percentile": 99.9,
			"latency_in_microseconds": 22863
		},
		{
			"percentile": 99.99,
			"latency_in_microseconds": 24623
		},
		{
			"percentile": 99.999,
			"latency_in_microseconds": 25423
		},
		{
			"percentile": 100,
			"latency_in_microseconds": 25439
		}
	]
}