http/results/retro2-classic-libev-R20000-r4.txt
Running 20s test @ http://127.0.0.1:19303/
  4 threads and 100 connections
  Thread calibration: mean lat.: 2.467ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.441ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.440ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.434ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.77ms    2.28ms  24.19ms   94.41%
    Req/Sec     5.27k     0.86k   11.11k    77.59%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.52ms
 75.000%    3.00ms
 90.000%    3.54ms
 99.000%   16.43ms
 99.900%   20.35ms
 99.990%   23.76ms
 99.999%   24.17ms
100.000%   24.21ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.081     0.000000            1         1.00
       1.135     0.100000        19753         1.11
       1.750     0.200000        39538         1.25
       2.111     0.300000        59363         1.43
       2.341     0.400000        79201         1.67
       2.523     0.500000        98818         2.00
       2.609     0.550000       108627         2.22
       2.699     0.600000       118714         2.50
       2.789     0.650000       128390         2.86
       2.891     0.700000       138360         3.33
       3.003     0.750000       148221         4.00
       3.063     0.775000       153156         4.44
       3.131     0.800000       158132         5.00
       3.205     0.825000       162971         5.71
       3.297     0.850000       167938         6.67
       3.403     0.875000       172844         8.00
       3.467     0.887500       175355         8.89
       3.537     0.900000       177783        10.00
       3.629     0.912500       180248        11.43
       3.741     0.925000       182692        13.33
       3.915     0.937500       185178        16.00
       4.055     0.943750       186393        17.78
       4.267     0.950000       187636        20.00
       4.635     0.956250       188860        22.86
       5.343     0.962500       190094        26.67
       6.855     0.968750       191329        32.00
       7.999     0.971875       191946        35.56
       9.423     0.975000       192563        40.00
      10.687     0.978125       193185        45.71
      11.999     0.981250       193800        53.33
      13.375     0.984375       194418        64.00
      14.495     0.985938       194723        71.11
      15.151     0.987500       195032        80.00
      15.999     0.989062       195340        91.43
      16.735     0.990625       195650       106.67
      17.455     0.992188       195966       128.00
      17.823     0.992969       196112       142.22
      18.255     0.993750       196268       160.00
      18.511     0.994531       196420       182.86
      18.799     0.995313       196584       213.33
      19.135     0.996094       196729       256.00
      19.343     0.996484       196810       284.44
      19.551     0.996875       196883       320.00
      19.679     0.997266       196961       365.71
      19.823     0.997656       197048       426.67
      19.951     0.998047       197120       512.00
      20.015     0.998242       197158       568.89
      20.079     0.998437       197196       640.00
      20.191     0.998633       197237       731.43
      20.271     0.998828       197274       853.33
      20.367     0.999023       197311      1024.00
      20.447     0.999121       197330      1137.78
      20.511     0.999219       197348      1280.00
      20.623     0.999316       197366      1462.86
      20.751     0.999414       197385      1706.67
      20.879     0.999512       197404      2048.00
      20.959     0.999561       197414      2275.56
      21.343     0.999609       197423      2560.00
      22.639     0.999658       197433      2925.71
      23.071     0.999707       197443      3413.33
      23.263     0.999756       197452      4096.00
      23.327     0.999780       197457      4551.11
      23.455     0.999805       197462      5120.00
      23.519     0.999829       197469      5851.43
      23.583     0.999854       197472      6826.67
      23.711     0.999878       197476      8192.00
      23.743     0.999890       197479      9102.22
      23.791     0.999902       197481     10240.00
      23.855     0.999915       197487     11702.86
      23.855     0.999927       197487     13653.33
      23.887     0.999939       197488     16384.00
      23.935     0.999945       197490     18204.44
      23.951     0.999951       197491     20480.00
      23.967     0.999957       197492     23405.71
      24.015     0.999963       197493     27306.67
      24.079     0.999969       197494     32768.00
      24.095     0.999973       197496     36408.89
      24.095     0.999976       197496     40960.00
      24.095     0.999979       197496     46811.43
      24.159     0.999982       197497     54613.33
      24.159     0.999985       197497     65536.00
      24.175     0.999986       197499     72817.78
      24.175     0.999988       197499     81920.00
      24.175     0.999989       197499     93622.86
      24.175     0.999991       197499    109226.67
      24.175     0.999992       197499    131072.00
      24.175     0.999993       197499    145635.56
      24.175     0.999994       197499    163840.00
      24.175     0.999995       197499    187245.71
      24.207     0.999995       197500    218453.33
      24.207     1.000000       197500          inf
#[Mean    =        2.769, StdDeviation   =        2.284]
#[Max     =       24.192, Total count    =       197500]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  398815 requests in 20.00s, 805.56MB read
Requests/sec:  19938.35
Transfer/sec:     40.27MB

JSON Output:
{
	"requests": 398815,
	"duration_in_microseconds": 20002412.00,
	"bytes": 844690170,
	"requests_per_sec": 19938.35,
	"bytes_transfer_per_sec": 42229415.63,
	"latency_distribution": [
		{
			"percentile": 50,
			"latency_in_microseconds": 2523
		},
		{
			"percentile": 75,
			"latency_in_microseconds": 3003
		},
		{
			"percentile": 90,
			"latency_in_microseconds": 3537
		},
		{
			"percentile": 99,
			"latency_in_microseconds": 16431
		},
		{
			"percentile": 99.9,
			"latency_in_microseconds": 20351
		},
		{
			"percentile": 99.99,
			"latency_in_microseconds": 23759
		},
		{
			"percentile": 99.999,
			"latency_in_microseconds": 24175
		},
		{
			"percentile": 100,
			"latency_in_microseconds": 24207
		}
	]
}